import { Component } from '@angular/core';
import { NewsService } from '../_services/index';

@Component({
    moduleId: module.id,
    templateUrl: 'news-list.component.html',
    styleUrls: ['news-list.component.css']
})

export class NewsListComponent {
    news = [
        {
            "id": 1,
            "name": "У Будапешті знову протести проти уряду Орбана1",
            "text": "Цього разу акції протесту носять яскраво виражений гротескний характер. Мітингарі \"вимагають\" ще більше демагогії, обмежень особистих прав та свобод, а також прямого залізничного  сполучення з Москвою та Пхеньяном.",
            "img": "http://www.dw.com/image/38441470_303.jpg"
        },
        {
            "id": 2,
            "name": "У Будапешті знову протести проти уряду Орбана1",
            "text": "Цього разу акції протесту носять яскраво виражений гротескний характер. Мітингарі \"вимагають\" ще більше демагогії, обмежень особистих прав та свобод, а також прямого залізничного  сполучення з Москвою та Пхеньяном.",
            "img": "http://www.dw.com/image/38441470_303.jpg"
        },
        {
            "id": 3,
            "name": "У Будапешті знову протести проти уряду Орбана1",
            "text": "Цього разу акції протесту носять яскраво виражений гротескний характер. Мітингарі \"вимагають\" ще більше демагогії, обмежень особистих прав та свобод, а також прямого залізничного  сполучення з Москвою та Пхеньяном.",
            "img": "http://www.dw.com/image/38441470_303.jpg"
        },
        {
            "id": 4,
            "name": "У Будапешті знову протести проти уряду Орбана1",
            "text": "Цього разу акції протесту носять яскраво виражений гротескний характер. Мітингарі \"вимагають\" ще більше демагогії, обмежень особистих прав та свобод, а також прямого залізничного  сполучення з Москвою та Пхеньяном.",
            "img": "http://www.dw.com/image/38441470_303.jpg"
        },
        {
            "id": 5,
            "name": "У Будапешті знову протести проти уряду Орбана1",
            "text": "Цього разу акції протесту носять яскраво виражений гротескний характер. Мітингарі \"вимагають\" ще більше демагогії, обмежень особистих прав та свобод, а також прямого залізничного  сполучення з Москвою та Пхеньяном.",
            "img": "http://www.dw.com/image/38441470_303.jpg"
        },
        {
            "id": 6,
            "name": "У Будапешті знову протести проти уряду Орбана1",
            "text": "Цього разу акції протесту носять яскраво виражений гротескний характер. Мітингарі \"вимагають\" ще більше демагогії, обмежень особистих прав та свобод, а також прямого залізничного  сполучення з Москвою та Пхеньяном.",
            "img": "http://www.dw.com/image/38441470_303.jpg"
        }
    ];

    constructor(
        private newsService: NewsService
    ) {
        this.getNews();
    }

    getNews() {
        this.newsService.getNews().subscribe(result => {
            if (result === true) {
                console.log(result);
                this.news = result;
                console.log('OK');
            }
        });
    }
}